In [1]:
import pandas as pd
import numpy as np

## Read csv data

In [2]:
Na2SO4_10g = pd.read_csv("./data/Na2SO4_10g.csv")
Na2SO4_30g = pd.read_csv("./data/Na2SO4_30g.csv")
Na2SO4_50g = pd.read_csv("./data/Na2SO4_50g.csv")
del Na2SO4_10g["Unnamed: 0"]
del Na2SO4_30g["Unnamed: 0"]
del Na2SO4_50g["Unnamed: 0"]

## Add attribute(Na2SO4)

In [3]:
Na2SO4_10g["Na2SO4"]=10
Na2SO4_30g["Na2SO4"]=30
Na2SO4_50g["Na2SO4"]=50

In [4]:
Na2SO4_10g.head()

   time  degree     20     15     10      5      0  Na2SO4
0     0      30  0.000  0.000  0.000  0.000  0.000      10
1     3      30  0.208  0.196  0.205  0.196  0.201      10
2     6      30  0.316  0.307  0.313  0.307  0.311      10
3     9      30  0.368  0.361  0.366  0.360  0.364      10
4    12      30  0.400  0.394  0.398  0.394  0.397      10

In [5]:
Na2SO4_30g.head()

   time  degree     20     15     10      5      0  Na2SO4
0     0    30.0  0.000  0.000  0.000  0.000  0.000      30
1     3    30.0  0.289  0.235  0.295  0.295  0.279      30
2     6    30.0  0.438  0.391  0.445  0.446  0.430      30
3     9    30.0  0.512  0.475  0.518  0.519  0.506      30
4    12    30.0  0.556  0.527  0.562  0.562  0.552      30

In [6]:
Na2SO4_50g.head()

   time  degree     20     15     10      5      0  Na2SO4
0     0    30.0  0.000  0.000  0.000  0.000  0.000      50
1     3    30.0  0.361  0.328  0.306  0.318  0.328      50
2     6    30.0  0.527  0.506  0.488  0.494  0.504      50
3     9    30.0  0.603  0.587  0.574  0.578  0.586      50
4    12    30.0  0.647  0.634  0.625  0.628  0.634      50

## Concatenate data

In [7]:
df = pd.concat([Na2SO4_10g, Na2SO4_30g, Na2SO4_50g])

In [8]:
df_list = df.to_numpy()
df_list = list(df_list)

## Preprocess

In [9]:
def makeDataList(array):
    new_array = list()
    for i in range(len(array)):
        for j in range(5):
            if j == 0:
                new_array.append([array[i][0],array[i][1],array[i][-1], 0, array[i][6]])
            elif j == 1:
                new_array.append([array[i][0],array[i][1],array[i][-1], 5, array[i][5]])
            elif j == 2:
                new_array.append([array[i][0],array[i][1],array[i][-1], 10, array[i][4]])
            elif j == 3:
                new_array.append([array[i][0],array[i][1],array[i][-1], 15, array[i][3]])
            elif j == 4:
                new_array.append([array[i][0],array[i][1],array[i][-1], 20, array[i][2]])
    
    return new_array

In [10]:
new_df_list = makeDataList(df_list)

In [11]:
new_df_list[:5]

[[0.0, 30.0, 10.0, 0, 0.0],
 [0.0, 30.0, 10.0, 5, 0.0],
 [0.0, 30.0, 10.0, 10, 0.0],
 [0.0, 30.0, 10.0, 15, 0.0],
 [0.0, 30.0, 10.0, 20, 0.0]]

In [12]:
column_names = ["time", "temperature", "Na2SO4", "Na2CO3", "target"]

In [13]:
data_df = pd.DataFrame(new_df_list, columns=column_names)

In [14]:
data_df.head()

   time  temperature  Na2SO4  Na2CO3  target
0   0.0         30.0    10.0       0     0.0
1   0.0         30.0    10.0       5     0.0
2   0.0         30.0    10.0      10     0.0
3   0.0         30.0    10.0      15     0.0
4   0.0         30.0    10.0      20     0.0

## Save final data

In [15]:
data_df.to_csv("./data/preprocessing_data.csv")